#!/usr/bin/python
# -*- coding: utf-8 -*-
from collections import Counter

string = "втѕшухжцжхнтчтшмтиумтшушљхзтбцзбцтжххшцлтзтицбтжхнтчтшмтсѕтмхтшуѕумтцнсцластшжучцгциунтчтѕмтушљцшц" \
         "гжтшжтнубхтчцхшцвжцхсзхужххсзхукзжкуихѕкунубхнтчтшхмтнуљцштгтшххмхжжтмзагоцсхочубхнаѓбхнбстнхбтчсужу" \
         "хнтчтшхмтвусххшхцмнзхќтбтжтхмжунцмзагужхцмихмтбтжтхмжунцмзагужхнтчтшхмтнхшзтдушхуљзхдузтшххмхжнцм" \
         "загсццсцлнсхбуштшхнбцдтнхчцгцтмцизтбтдхшлтхицгтбтушцвхмтцихдихмунхчцгцжтоужцбжтвусцбшцвхмтиумхнѕциц" \
         "мхжуаитсжцжухгцудгаиусшхљтбцбтѕожцнбтгуцбзамаѓубхжтѕаехбцгцдтитзучтмузтѓхнсхбцбнццшзтдтжхжтсѕхдхсцихм" \
         "тучзсцљзцѕхстрхзтдсусшхиздужтжцнхдтбсцзусшхсцнхихштѓужтбтѓбцмтстудциуѕнбсцжхцнбтсусцжхмцнбтбцчжтѓхбцджт" \
         "хрхжхжтљзтсукужуожужтѓтбтљтшхбжцнббхѓчтужхџаихджтљзхшжцгазтдшунѕастшхтљзхштѕчаоаснбсастшхљцсхќхцмштѓужх" \
         "зултжубзхиташтжцнбљцсхќхцмљтшхбжцнбжубзхитџаихджцнбуиѕтгцнбихдцсухчстѕубхбувусцбцбќхиумхжтнуѕхжунхќхиумх" \
         "удгаихжцтсуцжцбузтмуцбцжхдиѕувултнтштбтљзузцмтжтцсухудашусучтдтмцизужтбтчтлѕаехбцсучтдтажусхздтѕжцизтбнб" \
         "сцдтхмужнбсцбцжтнубхжтнмазуунхгтшцлцбгѕтнмцљузтмцшуѕуцжуѓузашнсхбцбшуѕуцжуцотлжуштвувхжууштѕумхктвз" \
         "бсужтнунбхшцбѓбцгубхзтштвубхмтштотбудтбсцзттбжхсужуѕаехжтцжухчцушцвтбмтшхнѕаѓжтбушсхѕтшжхцотластлбхш" \
         "удхзултбтѓбцнхгтжхцљјтбухнтшцшужастрхжттѕожцнбтгцзоужтбтжтѕаехбцчцунхљѕтѓтбцмљтбцбжтоцсхочуцбжтљзхмцч" \
         "цшзтдтбтжтѕаехбцќхљцшужхмучбтбцзубхќхашзтбтшцќбтѓбцлтдхмцтцмжтзцмцбќхшанхсзтбужтжтзцмцбунхмцмхчтѕаехбц" \
         "ашузттбнѕцицмтбтжучцгтѓжхштмтдтгужхсцлжукужхнхљзхмтстлбхжтизабтѕжубхѕаехштвучцусхљзхдузттбсхљцзциасттб" \
         "чцусугузхгхжхзузттбвусцбубхсучтвасттбѓбцмтљзтсубхѓбцмтшунѕубхуѓбцмтоаснбсастбхчцлсхмаљоусхмухбусхбзхбу" \
         "зтчтчцнбцчтсхчцзунбучтчцбцљцснчцшхнцжхнхљзхмтстлбхжтцсухжхљзузцмжуѕаехштѓужнчуѕаехнцштѓужнчуашуштѓужнч" \
         "унзктсухжхнбхштѓужусухжхнбхмциубцчсухнбхштвултуштбхџаицсбтчцжаштжцнбтсцстѓубхнзктсухжхшзтдубхнтшцжхнт" \
         "чтжубхшзтдтбжхџаихжубхужхљзузцмжубхсцлжукужхицзхбхнхдтзцљнбсцицзхбхнхдтнѕцицмтсцбцбцљцгѕтслхжтнсхбуѕач" \
         "тљуѓастктзнбсцбцицвлцхсцоцсхчцбжххмхжоцсхчжубагзаљтѕаехбачасцнубхѕаехсцбхихсухжтзцмцблтуштбхшцќбтшцќбт" \
         "мтнцдмтстбхштѓужушцќбтмтнхнцдмтмхнзхќтсухѕаехбцуштбхшцќмтгцжтљзтсубхцсцлвусцбнѕцицмхжуаитсмтгцжтљзтсуб" \
         "хцсцлвусцбљзхчзтнжттстжбазтбцгтѓсцушхжтмхшцчзтбултбтмтлтунчцзунбушхбттшцќмтнхцихмужушхнубхмтнхицзушхдт" \
         "жцснсхбљзунбцхжнсхбчцлќхушмтмхѓтжнтжтштвубхмтзтицбтбчцлжтшѕтмубхќхушмтмхумжужттжтнбтзцнбтнугазжцнбнцсх" \
         "бастрхбцдтцсухзтицбуизабтѕжубхѕаехмцлмцтжтсѕтнбжцбухѕтвтббухжхгцунљцѕжасттббцтсхбастрхбухжучцгтѓжхштмуч" \
         "бтбцзубхнхцнѕцицмасттбжцгцзциасттбжтзцмцбнхгтмтнхицзушхмтгцунљцѕжушхбцтсхбастрхмтнхицзушхмтгццнѕцицмуш" \
         "хнсхбцбмтгуцбнбзтжушхжткуцжтѕжубхитзухзумтлтцбнбзтжушхтѕожцнбтцшзтдтбтужхбзљхѕусцнбтмтнхицзушхдтнсхбжт" \
         "зтдашцбнсхбсцчцлжтачтбтужтљзхмцчцбќхмцсхмтбмцнзхќтбтжтнубхѕаехсцлжукусцушхжтмхшцчзтбултбтмтнхцихмужушх" \
         "нубх";
normalna_azbuka = ['а', 'б', 'в', 'г', 'д', 'ѓ', 'е', 'ж', 'з', 'ѕ', 'и', 'ј', 'к', 'л', 'љ', 'м', 'н', 'њ', 'о', 'п',
                   'р', 'с', 'т', 'ќ', 'у', 'ф', 'х', 'ц', 'ч', 'џ', 'ш']
izmesana_azbuka = ['т', 'б', 'в', 'г', 'д', 'ѓ', 'е', 'ж', 'з', 'ѕ', 'и', 'ј', 'к', 'л', 'љ', 'м', 'н', 'њ', 'х', 'п',
                   'р', 'с', 'а', 'ќ', 'у', 'ф', 'о', 'ц', 'ч', 'џ', 'ш']

def build_frequency_list(s):
    lista = [(s.count(c), c) for c in normalna_azbuka]
    return lista

def decrypt(text):
    result = ""
    for letter in text:
        if(letter=="т"):
            result+="а"
        elif(letter=="ж"):
            result+="н"
        elif(letter=="ц"):
            result+="о"
        elif(letter=="у"):
            result+="и"
        elif (letter == "б"):
            result += "т"
        elif (letter == "х"):
            result += "е"
        elif (letter == "с"):
            result += "в"
        elif (letter == "н"):
            result += "с"
        elif (letter == "з"):
            result += "р"
        elif (letter == "м"):
            result += "д"
        elif (letter == "ш"):
            result += "м"
        elif (letter == "а"):
            result += "у"
        elif (letter == "ч"):
            result += "к"
        elif (letter == "ѕ"):
            result += "л"
        elif (letter == "и"):
            result += "б"
        elif (letter == "д"):
            result += "з"
        elif (letter == "љ"):
            result += "п"
        elif (letter == "г"):
            result += "г"
        elif (letter == "л"):
            result += "ј"
        elif (letter == "ѓ"):
            result += "ш"
        elif (letter == "в"):
            result += "ж"
        elif (letter == "ќ"):
            result += "ќ"
        elif (letter == "о"):
            result += "ч"
        elif (letter == "е"):
            result += "ѓ"
        elif (letter == "к"):
            result += "ц"
        elif (letter == "р"):
            result += "њ"
        elif (letter == "џ"):
            result += "љ"
        elif (letter == "ј"):
            result += "ф"
        elif (letter == "њ"):
            result += "ѕ"
        elif (letter == "п"):
            result += "х"
        elif (letter == "ф"):
            result += "џ"
        else:
            index = izmesana_azbuka.index(letter)
            result += normalna_azbuka[index]
    return result

enkriptiranaLista = build_frequency_list(string)
enkriptiranaLista.sort(key=lambda y:y[0],reverse=True)
print(enkriptiranaLista)

dekriptiran = decrypt(string)


dekriptiranaLista = build_frequency_list(dekriptiran)
dekriptiranaLista.sort(key=lambda y:y[0],reverse=True)
print(dekriptiranaLista)


res = (Counter(string[idx : idx + 2] for idx in range(len(string) - 1))).most_common()
print("Фреквенција на парови букви : " + str(dict(res)))

print(dekriptiran)

final_res=open("krajno_reshenie.txt", "w", encoding="utf-8")
final_res.write(dekriptiran)
final_res.close()

"""print(f'шемата "носамадва" се појавува {dekriptiran.count("носамдва")} пати')
print(f'шемата "меже" се појавува {dekriptiran.count("меже")} пати')
print(f'шемата "анмоаса" се појавува {dekriptiran.count("анмоаса")} пати')
print(f'шемата "анмо" се појавува {dekriptiran.count("анмо")} пати')
print(f'шемата "нмоасадва" се појавува {dekriptiran.count("нмоасадва")} пати')
print(f'шемата "нио" се појавува {dekriptiran.count("нио")} пати')
print(f'шемата "ниоасадоа" се појавува {dekriptiran.count("ниоасадоа")} пати')"""

